Podkova/src/Documents/КассоваяСмена/КассоваяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассоваяСмена</name>
  <registerRecords>AccumulationRegister.ШМ_ЗПРаботникам</registerRecords>
  <attributes>
    <name>ДатаПервогоНепереданногоФД</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСменыККТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>DefinedType.КассаБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНепереданныхФД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаСтрочнаяЗаменаФН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПамятьФНПереполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПревышеноВремяОжиданияОтветаОФД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсФНИсчерпан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКассовойСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФДОЗакрытииСмены</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальноеУстройство</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРегламентныхОпераций</name>
    <type>
      <types>EnumRef.СтатусыРегламентныхОперацийКассовойСмены</types>
    </type>
  </attributes>
</mdclass:Document>

Podkova/src/AccumulationRegisters/ШМ_ЗПРаботникам/ШМ_ЗПРаботникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ШМ_ЗПРаботникам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помощник</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Podkova/src/InformationRegisters/ШМ_Затраты/ШМ_Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_Затраты</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>CatalogRef.ШМ_Затраты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профессия</name>
    <type>
      <types>CatalogRef.ШМ_Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/СтатусыКассовойСмены/СтатусыКассовойСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКассовойСмены</name>
  <enumValues>
    <name>Открыта</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Documents/КассоваяСмена/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	КассовыеСменыПереопределяемый.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КассовыеСменыПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	КассовыеСменыПереопределяемый.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда  
		
		Движения.ШМ_ЗПРаботникам.Записывать = Истина;  
		
		НаборЗаписей = ЗаписиРегистраШМ_Затраты(ЭтотОбъект.НачалоКассовойСмены, ЭтотОбъект.ОкончаниеКассовойСмены);
		
		Для Каждого стр из НаборЗаписей Цикл
			Движение = Движения.ШМ_ЗПРаботникам.Добавить();
			Движение.Период = стр.Период;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Исполнитель = стр.Сотрудник;
			Движение.Сумма= стр.Сумма;
		КонецЦикла;	
	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ЗаписиРегистраШМ_Затраты(ДатаНачала, ДатаКонца)

	лТекст = "ВЫБРАТЬ
	         |	ШМ_Затраты.Период КАК Период,
	         |	ШМ_Затраты.Затрата КАК Затрата,
	         |	ШМ_Затраты.Сотрудник КАК Сотрудник,
	         |	ШМ_Затраты.Профессия КАК Профессия,
	         |	ШМ_Затраты.Сумма КАК Сумма
	         |ИЗ
	         |	РегистрСведений.ШМ_Затраты КАК ШМ_Затраты
	         |ГДЕ
	         |	ШМ_Затраты.Период МЕЖДУ &Период1 И &Период2";

	лЗапрос = Новый Запрос(лТекст);
	
	Если ДатаКонца < ДатаНачала Тогда
		ДатаКонца = ТекущаяДата(); 
	КонецЕсли;	
	лЗапрос.УстановитьПараметр("Период1", ДатаНачала);
	лЗапрос.УстановитьПараметр("Период2", ДатаКонца);


	лВыборка = лЗапрос.Выполнить().Выгрузить(); 
	
	Возврат лВыборка

КонецФункции

#КонецОбласти

#КонецЕсли
